// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя) 
int n = 7;
int result;
result = n  *   n;
Console.Write("Результат = ");
Console.WriteLine(result);